* 행번호 = 행 위치(0부터 +1씩 증가하는 정수) == 문자열,리스트의 index와 동일
* 열번호도 동일.

In [3]:
import pandas as pd
df = pd.read_csv('data/scores.csv')
# df.index = range(10,310,10)
df.index = 'i'+df.index.astype('str')

# 행번호로 행 데이터 추출하기(iloc)
* 데이터프레임명.iloc[행번호]
* 데이터프레임명.iloc[행번호리스트]
* 데이터프레임명.iloc[행번호슬라이스]
* 음수를 사용하면 행번호를 뒤에서부터 센다.

In [2]:
df.head()

    name  kor  eng  math
i0     1    5    5    10
i1     2    0    0    10
i2     3   10   10    10
i3     4    6    6    10
i4     5   10   10    10

## 시리즈 형태로 추출

In [4]:
# 첫번째 행 추출
df.iloc[0]

name     1
kor      5
eng      5
math    10
Name: i0, dtype: int64

## 데이터프레임 형태로 추출

In [7]:
#1,3,5번 행 추출
df.iloc[[1,3,5]]

    name  kor  eng  math
i1     2    0    0    10
i3     4    6    6    10
i5     6    0    0    10

In [9]:
# 첫번째 행 데이터프레임으로 추출
df.iloc[[0]]

    name  kor  eng  math
i0     1    5    5    10

## 행번호 슬라이스로 추출

In [10]:
# 1~3행 추출
df.iloc[1:4]

    name  kor  eng  math
i1     2    0    0    10
i2     3   10   10    10
i3     4    6    6    10

In [11]:
# 1,3,5행 슬라이스
df.iloc[1:6:2]

    name  kor  eng  math
i1     2    0    0    10
i3     4    6    6    10
i5     6    0    0    10

In [13]:
# 1행 추출
df.iloc[1:2]

    name  kor  eng  math
i1     2    0    0    10

In [14]:
# 짝수 행번호 데이터 추출
df.iloc[::2]

            name  kor  eng  math
i0             1    5    5    10
i2             3   10   10    10
i4             5   10   10    10
i6             7    1    1    10
i8             9    1    1    10
...          ...  ...  ...   ...
i1048566  120796   10   10     0
i1048568  120798    9    9     0
i1048570  120800   10   10     0
i1048572  120802    1    1     0
i1048574  120804    0    0     0

[524288 rows x 4 columns]

In [16]:
# 홀수 행번호 데이터 추출
df.iloc[1::2]

            name  kor  eng  math
i1             2    0    0    10
i3             4    6    6    10
i5             6    0    0    10
i7             8    2    2    10
i9            10   10   10    10
...          ...  ...  ...   ...
i1048565  120795   10   10     0
i1048567  120797   10   10     0
i1048569  120799   10   10     0
i1048571  120801   10   10     0
i1048573  120803   10   10     0

[524287 rows x 4 columns]

## 음수 행번호로 추출

In [17]:
# 마지막 행 추출
df.iloc[-1]

name    120804
kor          0
eng          0
math         0
Name: i1048574, dtype: int64

In [18]:
# 마지막 2개 행 추출(리스트)
df.iloc[[-2,-1]]

            name  kor  eng  math
i1048573  120803   10   10     0
i1048574  120804    0    0     0

In [19]:
# 마지막 2개 행 추출(스라이스)
df.iloc[-2:]

            name  kor  eng  math
i1048573  120803   10   10     0
i1048574  120804    0    0     0

# 행번호, 열번호로 행,열 추출하기
## iloc[행번호,열번호]

In [22]:
df.head()

    name  kor  eng  math
i0     1    5    5    10
i1     2    0    0    10
i2     3   10   10    10
i3     4    6    6    10
i4     5   10   10    10

In [23]:
# 0번째 행, 0번째 열
df.iloc[0,0]

1

## iloc[행번호,열번호리스트]

In [24]:
# 0번째 행 kor,eng
df.iloc[0,[1,2]]

kor    5
eng    5
Name: i0, dtype: int64

## iloc[행번호리스트,열번호]

In [29]:
# 1,3,4번째 행 kor
df.iloc[[1,3,4],1]

i1     0
i3     6
i4    10
Name: kor, dtype: int64

## iloc[행번호리스트,열번호리스트]

In [27]:
# 1,3,4번째 행 name,eng
df.iloc[[1,3,4],[0,2]]

    name  eng
i1     2    0
i3     4    6
i4     5   10

## iloc[행번호슬라이싱,열번호슬라이싱]

In [31]:
df.head()

    name  kor  eng  math
i0     1    5    5    10
i1     2    0    0    10
i2     3   10   10    10
i3     4    6    6    10
i4     5   10   10    10

In [32]:
# 0,1번째 행 0,1번째 열 슬라이싱
df.iloc[:2,:2]

    name  kor
i0     1    5
i1     2    0

In [36]:
# 1,3,5번째 행 0,2번째 열 슬라이싱
df.iloc[1:6:2,:3:2]

    name  eng
i1     2    0
i3     4    6
i5     6    0

In [37]:
df.tail()

            name  kor  eng  math
i1048570  120800   10   10     0
i1048571  120801   10   10     0
i1048572  120802    1    1     0
i1048573  120803   10   10     0
i1048574  120804    0    0     0

In [38]:
# 마지막행 1,3행 슬라이싱
df.iloc[-1,1:4:2]

kor     0
math    0
Name: i1048574, dtype: int64

In [39]:
# 모든행, 1열
df.iloc[:,1]

i0           5
i1           0
i2          10
i3           6
i4          10
            ..
i1048570    10
i1048571    10
i1048572     1
i1048573    10
i1048574     0
Name: kor, Length: 1048575, dtype: int64

In [41]:
# 모든행, 1,2열
df.iloc[:,[1,2]]

          kor  eng
i0          5    5
i1          0    0
i2         10   10
i3          6    6
i4         10   10
...       ...  ...
i1048570   10   10
i1048571   10   10
i1048572    1    1
i1048573   10   10
i1048574    0    0

[1048575 rows x 2 columns]